---
kind: other
id: Methods.T:Autodesk.Revit.DB.ViewNode
source: html/77844264-ed90-03bb-24dc-ec794a72f12d.htm
---
# ViewNode Methods

Information about the observation point (the camera) of the view.